// 10. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.\

// int x = new Random().Next(100, 1000);
// int sec_pos = (x / 10) - (x / 100) * 10;
// Console.Write($"sec_pos in {x} is {sec_pos}");


// 13. Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// Console.Write("Enter number up to 1000 >>> ");
// int x = Convert.ToInt32(Console.ReadLine());
// int first_pos;

// if (x / 100 == 0) {
//     Console.Write("Не прокатит, меньше 100..");
// }   else {
//     first_pos = x / 100;
//     Console.Write($"first_pos in {x} is {first_pos}");
// }


// 15. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// Console.Write("Enter day of the week >>> ");
// int x = Convert.ToInt16(Console.ReadLine());

// if (x > 0 && x < 8){
//     if (x == 6 || x == 7) Console.Write($"Да. Отдыхаем!!!"); else Console.Write("Нет. На завод!!!");
// } else Console.Write("Лукавим?");


