// 1.

/*
Console.Write("Enter number >>> ");
int num1 = Convert.ToInt16(Console.ReadLine());

Console.Write("Enter number >>> ");
int num2 = Convert.ToInt16(Console.ReadLine());

if (num1 == num2 * num2) 
{
    Console.WriteLine(num1 + " is squared " + num2);
} 
else 
{
    Console.Write(num1 + " isn't squared "+ num2);
}
*/

// 2. DZ

/*
Console.Write("Enter day of the week >>> ");
int weekDay = Convert.ToInt16(Console.ReadLine());


if (weekDay < 1 || weekDay > 7)
{
    Console.Write("Error");
}
if (weekDay == 1)
{
    Console.Write("Monday");
}
if (weekDay == 2)
{
    Console.Write("Thuesday");
}
if (weekDay == 3)
{
    Console.Write("Wednesday");
}
if (weekDay == 4)
{
    Console.Write("Thursday");
}
if (weekDay == 5)
{
    Console.Write("Friday");
}
if (weekDay == 6)
{
    Console.Write("Saturday");
}
if (weekDay == 7)
{
    Console.Write("Sunday");
}
*/

// 3. DZ

// 4. DZ

// 5. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4" 
// 2 -> " -2, -1, 0, 1, 2"

// 6. DZ

// 7. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.   456 -> 6	782 -> 2	918 -> 8
